In [2]:
def test_range(n):
    if n in range(3,9):
        print("%s is in the range"%str(n))
    else:
        print("The number is outside the range")
        
test_range(5)

5 is in the range

In [4]:
def string_test(s):
    d = {"UPPERCASE" :0, "LOWERCASE" :0}
    for c in s:
        if c.isupper():
            d["UPPERCASE"] += 1
        elif c.islower():
            d["LOWERCASE"] += 1
        else:
            pass
    print("Original string is:")
    print ("Number of Uppercase of original string is", d["UPPERCASE"])
    print("Number of lowercase of original string is",d["LOWERCASE"])
    
string_test("The quick brown fox in the Jungle")

Original string is:
Number of Uppercase of original string is 2
Number of lowercase of original string is 25

In [9]:
def list_number(numbers):
    uniq_number = []
    for a in numbers:
        if a not in uniq_number:
            uniq_number.append(a)
            
    return uniq_number

print(list_number([7,6,1,2,4,9,12,4,12,9]))

[7, 6, 1, 2, 4, 9, 12]

In [14]:
def list_even_numbers(list):
    e_num = []
    for a in list:
        if a % 2 == 0:
            e_num.append(a)
    return e_num
print(list_even_numbers([7,6,1,2,4,9,12,4,12,9]))

[6, 2, 4, 12, 4, 12]

In [15]:
def grab_children(father):
    local_list = []
    for key, value in father.iteritems():
        local_list.append(key)
        local_list.extend(grab_children(value))
    return local_list

print grab_children(top)

SyntaxError: invalid syntax (Temp/ipykernel_8492/2288653913.py, line 8)

In [16]:
my_dict = { 'new_dic1': {'Country': 'Indonesia', 'Value': '240'},
         'new_dic2': {'student': 'George', 'stu_age': '39'}}
new_val = [(ne_key, ne_value) for ne_key, ne_value in my_dict.items()] 
print(new_val)

[('new_dic1', {'Country': 'Indonesia', 'Value': '240'}), ('new_dic2', {'student': 'George', 'stu_age': '39'})]

In [23]:
new_val =[('new_dic1', {'Country': 'Indonesia', 'Value': '240'}),
 ('new_dic2', {'student': 'George', 'stu_age': '39'})]

[[('new_dic1', {'Country': 'Indonesia', 'Value': '240'}), ('new_dic2', {'student': 'George', 'stu_age': '39'})]]

In [41]:
def divide_chunks(l, n):
     
    # looping till length l
    for i in range(0, len(l), n):
        yield l[i:i + n]
 
# How many elements each
# list should have
n = 1
 
x = list(divide_chunks(new_val, n))
print (x)

[[('new_dic1', {'Country': 'Indonesia', 'Value': '240'})], [('new_dic2', {'student': 'George', 'stu_age': '39'})]]

In [45]:
x

[[('new_dic1', {'Country': 'Indonesia', 'Value': '240'})],
 [('new_dic2', {'student': 'George', 'stu_age': '39'})]]

In [54]:
import pandas as pd
# create a dataframe
df = pd.DataFrame(x)
df

                                                   0
0  (new_dic1, {'Country': 'Indonesia', 'Value': '...
1  (new_dic2, {'student': 'George', 'stu_age': '3...

In [55]:
split_df = pd.DataFrame(df[0].tolist())
split_df

          0                                         1
0  new_dic1  {'Country': 'Indonesia', 'Value': '240'}
1  new_dic2    {'student': 'George', 'stu_age': '39'}

In [60]:
s = pd.DataFrame(split_df[1].tolist())
s

     Country Value student stu_age
0  Indonesia   240     NaN     NaN
1        NaN   NaN  George      39